package com.entage.nrd.entage.login;

import android.app.Activity;
import android.content.Context;
import android.content.Intent;
import android.net.Uri;
import android.os.Bundle;

import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.webkit.WebSettings;
import android.webkit.WebView;
import android.widget.ImageView;
import android.widget.TextView;

import com.entage.nrd.entage.R;
import com.google.firebase.database.FirebaseDatabase;

import java.util.ArrayList;


public class FragmentTermsAndConditions extends Fragment {
    private static final String TAG = "FragmentTermsAndCondi";

    private Context mContext ;
    private View view;

    private ImageView backArrow;
    private TextView titlePage, largeText;
    private WebView mWebView;

    @Nullable
    @Override
    public View onCreateView(LayoutInflater inflater, @Nullable ViewGroup container, @Nullable Bundle savedInstanceState) {
       view = inflater.inflate(R.layout.fragment_privacy_policy , container , false);
        mContext = getActivity();

        inti();
       return view;
    }


    private void inti() {
        initWidgets();
        onClickListener();
    }

    private void initWidgets(){
        backArrow = view.findViewById(R.id.back);
        backArrow.setVisibility(View.VISIBLE);

        titlePage = view.findViewById(R.id.titlePage);
        titlePage.setText(mContext.getString(R.string.term_text));


        largeText = view.findViewById(R.id.mylargeText);

        mWebView = view.findViewById(R.id.mWebView);
        mWebView.getSettings().setBuiltInZoomControls(false);
        mWebView.getSettings().setLoadWithOverviewMode(false);
        mWebView.getSettings().setUseWideViewPort(false);
        mWebView.getSettings().setDefaultZoom(WebSettings.ZoomDensity.CLOSE);
        mWebView.loadUrl("https://entage-1994.firebaseapp.com/");

        Intent browserIntent = new Intent(Intent.ACTION_VIEW, Uri.parse("https://entage-1994.firebaseapp.com/terms_and_conditions.html"));
        ((Activity)mContext).startActivity(browserIntent);
        /*Query query = FirebaseDatabase.getInstance().getReference()
                .child(mContext.getString(R.string.dbname_app_data))
                .child("d");
        query.addListenerForSingleValueEvent(new ValueEventListener() {
            @Override
            public void onDataChange(@NonNull DataSnapshot dataSnapshot) {
                if(dataSnapshot.exists()){
                    Log.d(TAG, "onDataChange: " + dataSnapshot.getValue().toString());
                    largeText.setText(dataSnapshot.getValue().toString());
                }
            }
            @Override
            public void onCancelled(@NonNull DatabaseError databaseError) {
            }
        });*/



       /* ArrayList<terms> terms = new ArrayList<>();
        HashMap<String, String> arrayList = new HashMap<>();


        terms.add(new terms("المقدمة والاحكام عامة", "أهلاً بكم في انتاجي الإلكتروني ، فيما يلي البنود والشروط التي تخص شروط الاستخدام والدخول لصفحات موقع \" انتاجي \"” تعطى الكلمات والتعابير الواردة في هذه الاتفاقية المعاني المحددة لها كما يلي :\n" +
                "ويقصد بها شركة انتاجي الإلكترونية. \" انتاجي \"وهي شركة منطقة حرة ذات مسؤولية محدودة\n" +
                "\"الموقع\": يقصد به أينما ورد في الاتفاقية \"انتاجي\" كما وتعتبر كافة الصفحات و الروابط و التطبيقات والأدوات والخواص المتفرعة من الموقع والمتعلقة بالخدمات المقدمة منه جزء لا يتجزء من انتاجي الإلكتروني. \n" +
                "\"العميل\": ويقصد به الجهة التي تطلب الخدمة من \"الموقع\" سواء كانت هذه الجهة شخص طبيعي أو شخص أعتبا . \n" +
                "\"الاتفاقية\": ويقصد بها اتفاقية شروط واحكام استخدام موقع انتاجي الإلكتروني والتي تتضمن كافة الاحكام والشروط الموضحة للعميل والتي تحكم وتنظم عملية إستخدام العميل لموقع انتاجي الإلكتروني. \n" +
                "يقر ويوافق العميل على ان إستخدامه للموقع يعتبر إقرار صريح وواضح ويفيد بقيامه بقراءة وفهم بنود وأحكام هذه الاتفاقية و طريقة إستخدام الموقع كما ويعتبر قبول وموافقة صريحة منه على شروط واحكام هذه الاتفاقية والاستجابة لها وهو بكامل الاهلية المعتبرة شرعاً وقانوناً. كما ويعتبر استخدام العميل للموقع اقرار صريح منه على الالتزام والاستجابة لكافة شروط واحكام الاتفاقية و وكافة الاحكام والشروط لخاصة بشركة انتاجي\n" +
                "من المعلوم للعميل بأنه وفي حالة إختيار شرط الموافقة، فإن أحكام وشروط الاتفاقية انتاجي تعتبر سارية المفعول بمواجهة العميل.\n"));

        terms.add(new terms("التأهل للعضوية", "-"));

        terms.add(new terms("حسابك والتزامات التسجيل", "فور تقديم طلب التسجيل للحصول على عضوية في الموقع يلتزم العميل بالإفصاح عن معلومات محددة وإختيار اسم مستخدم وكلمة مرور سرية لاستعمالها عند الدخول للموقع. وعند قبول طلب التسجيل ستعتبر عضوا بالموقع وبذلك تكون قد وافقت على:\n" +
                "أن تكون مسؤولاً بصفة خاصة بالمحافظة على سرية المعلومات المتعلقة بحسابك وكلمة المرور السرية وتحديد الأشخاص المسموح لهم بالوصول واستخدام حسابك بالموقع.\n" +
                "يلتزم العمل وفي حالة حدوث اي استخدام غير قانوني او اي عملية اختراق للحساب الخاص به بضرورة إعلام الموقع و انتاجي كوم فوراً بهذا الاستخدام.\n" +
                "في حالة عدم اعلام الموقع او انتاجي فوراً عن اي اتستخدام غير قانوني و/او اختراق لحساب العميل فإن الموقع أو انتاجي لا تتحمل اي مسؤوليه .\n" +
                "لن يكون الموقع و شركة انتاجي الاكترونية حال من الأحوال مسؤولاً عن أي خسارة قد تلحق بك بشكل مباشر أو غير مباشر معنويا أو ماديا نتيجة كشف معلومات إسم المستخدم أو كلمة الدخول.\n" +
                "من المعلوم للعميل بأنه هو الشخص المسؤول بالمحافظة على استخدام الموقع بكل جدية و مصداقية ويتعتبر ملزما بتعويض الموقع و انتاجي عن أي خسائرواضرار قد تلحق انتاجي والموقع نتيجة أي استخدام غير شرعي أو حقيقي أو مفوض لحسابك من طرفك أو من طرف أي شخص آخر حصل على مفاتيح الوصول إلى حسابك بالموقع سواء كان لإنجاز خدمات وغيرها باستعمال اسم المستخدم وكلمة الدخول، سواء بتفويض منك أو بلا تفويض.\n" +
                "يقر العميل بأن كافة المعلومات التي قام بالافصاح عنها هي معلومات حقيقية وصحيحة و محدثة و كاملة تعبر عنه وتتوافق مع ما هو مطلوب في استمارة التسجيل لدى الموقع.\n" +
                "أن لا تدرج ضمن بطاقة التسجيل أي من تفاصيل الاتصال بك كعناوين البريد الإلكتروني أو أرقام هواتفك أو أي تفاصيل شخصية، أو كلمة \" انتاجي \" في هوية تسجيل المستخدم.\n" +
                "أن لا يتضمن اسم محلك التجاري كلمة \" انتاجي\" أو شعاره.\n" +
                "يلتزم الموقع بالتعامل مع معلوماتك الشخصية وعناوين الإتصال بك بسريّة تامة مع الأعضاء الآخرين ويتم تزويد الأعضاء بمعلومات التي تختارها في طريقة عرض سلعك او الشرا فقط فور إتمام العمليات التجارية.\n" +
                "سوف تكون ملزماً بالحفاظ على بيانات التسجيل وتحديثها تباعاً وذلك لغايات الابقاء عليها حقيقية وصحيحة وراهنة وكاملة، وإذا ما أفصحت عن معلومات غير حقيقية أو غير صحيحة أوغير راهنة أوغير كاملة او مخالفة لما جاء في اتفاقية المستخدم، فإن للموقع و/او انتاجي الحق كاملاً في وقف أو تحديد أو إلغاء عضويتك و حسابك في الموقع، وذلك دون الحاق الأضرار بحقوق الموقع و/او انتاجي الأخرى ووسائله المشروعة في استرداد حقوقه.\n" +
                "للموقع و/او انتاجي مطلق الإرادة وفي أي وقت أن يجري أي تحقيقات يراها ضرورية (مباشرة أو عبر طرف ثالث) ويطالبك بالإفصاح عن معلومات إضافية أو وثائق مهما كان حجمها لاثبات هويتك و/أو ملكيتك لأدواتك المالية.\n" +
                "في حالة كان مقدم طلب التسجيل ممثلاُ لمؤسسة تجارية أو شركة فإنه يلتزم بتزويد كافة المعلومات والوثائق المطلوبة والتي منها على سبيل المثال لا الحصر ما يتضمن رخصتك التجارية، وأية وثائق أخرى للمؤسسة و/أو وثائق تظهر مسؤولية أي شخص يتصرف نيابة عنك.\n" +
                "يقر العميل بأنه موافق على تزويد الموقع و/او انتاجي.  أية معلومات و/أو وثائق فورا عند طلبها منه . انتاجي.\n" +
                "في حالة عدم الإلتزام بأي مما ورد إعلاه فإن لإدارة الموقع و/او انتاجي الحق في إيقاف أو إلغاء عضويتك و حجبك عن الموقع. ونحتفظ كذلك بالحق في إلغاء أي حسابات غير مؤكدة وغير مثبتة أو عمليات أو حسابات مر عليها مدة طويلة دون نشاط.\n"));

        terms.add(new terms(" الاتصالات الإلكترونية", "يقر ويوافق العميل على أن يتم التواصل معه عبر البريد الإلكتروني، أو من خلال بث إعلانات ترويجة على الموقع، كما ويقر ويوافق على أن جميع الاتفاقيات والإعلانات والبيانات والاتصالات الأخرى التي تزود بها الكترونياً تقوم مقام مثيلاتها المكتوبة، في تلبية الاحتياجات القانونية.\n" +
                "سيقوم الموقع و/او انتاجي خلال فترة عضويتك بإرسال رسائل إلكترونية تروجية لتعريفك بأي تغيرات أو إجراءات أو نشاطات دعائية جديدة قد تضاف إلى الموقع.\n" +
                "لك الحق كمستخدم بتأكيد عدم رغبتك في تلقي الرسائل الإلكترونية الدعائية، ويمكنك إلغاء تلقي مثل هذه الرسائل، وذلك بالضغط على خيار طلب عدم إستلام رسائل ترويجية والمتوفرة في أسفل الرسائل الترويجية و الإعلانية \n"));

        terms.add(new terms("تعديلات على اتفاقية المستخدم و ألية عمل الموقع", "أنت تعلم وموافق على أن الموقع و/او انتاجي يقوم بإ علامك عن أي تعديل على اتفاقية المستخدم، وبموجبه هذه التعديلات فإنه من الممكن أن تتضاعف التزاماتك وفقاً لأي تعديلات قد تجرى على إتفاقية الإستخدام.\n" +
                "يقر ويوافق العميل على أن للموقع و/او انتاجي وبمطلق صلاحيتهما ودون تحملهما المسؤولية القانونية أن تجري اية تعديلات أساسية أو فرعية على هذه الإتفاقية دون أن يتطلب ذاك موافقة إضافية من طرفك، وذلك في أي وقت وبأثر فوري، ويتم اعلامكم بهذه التعديلات بواسطة بث إعلان على الموقع.\n" +
                "من المعلوم للعميل بأن الموقع لا يعتبر مزاداً أو بنكا ًولا يقدم خدمات مماثلة، وانما هو موقع الكتروني يتم من خلاله بيع وشراء البضائع بين البائعين والمشترين المسجلين بالموقع.\n" +
                "العضوية على الموقع مجانية لحد معين ويتم تزويد المساحة المجانية او تقليصة من قبل الموقع او انتاجي. و يحق للموقع و/او انتاجي فرض رسوم إبرام الصفقات على البائعين عند بيع بضاعتهم عن طريق الموقع، ومن المعلوم بأن هناك رسوم إعلانات إختيارية في حالة طلبها و إستخدامها لترويج البضائع على الموقع.\n" +
                "يلتزم البائعين بدفع كافة الرسوم المستحقة للموقع خلال 30 يوما بحد أقصى بعد استكمال أي عملية بيع ناجحة.\n" +
                "على البائع أن يبلغ إدارة الموقع حسب الأصول بأي عملية بيع غير ناجحة لأي سبب كان، وسيقوم الموقع بإلغاء العمولة المحتسبة على السلعة .\n" +
                "يحق للبائع إلغاء أو إسترداد قيمة أي عمولات إحتسبت أو خصمت على عمليات لم تتم.\n" +
                "قبل عرضك لأي سلعة لغايات بيعها عن طريق الموقع عليك مراجعة تفاصيل الرسوم المحددة التي سيتم إحتسابها على عملياتك ويترتب عليك سدادها فور إصدار الفواتير الشهرية الخاصة بحساب عملياتك على الموقع،\n" +
                "للموقع الحق بعمل تعديلات على رسوم العمليات بما يراه مناسبا وسيتم الإعلان عن أي تعديل من خلال مراسلتك على بريدك الإلكتروني، و قد تكون التعديلات مؤقتة أو مستمرة سواء كانت على الرسوم أو تفاصيل خدمات الشحن وعليك الالتزام بها وفق بنودها حين يتم الإعلان عنها .\n" +
                "كافة الرسوم تحتسب بالعملة المحلية لموقع البلد الذي سجلت به. وعليك دفع كافة الرسوم المستحقة على عملياتك بالموقع إلى الموقع او انتاجي مضافاً إليها أي ضرائب أو نفقات أخرى، وذلك في غضون 30 يوماً من تاريخ الفاتورة المرسلة من الموقع او انتاجي ، على أن يتم السداد بواسطة الوسائل المعتمدة لذلك.\n" +
                "في حال عدم إلتزامك بدفع الرسوم أو النفقات المحتسبة على عملياتك في الموقع، فإن الموقع و/او انتاجي وبدون أدنى مسؤولية قانونية يحتفظ بحقه في : \n" +
                "إصدار وتوجيه إنذار رسمي لك لعدم إلتزامك بالسداد بالوقت المحدد.\n" +
                "في حال لم يتم سداد المستحقات المالية في مدة أقصاها 7 أيام من تاريخ إصدار الموقع و/او انتاجي للإنذار فيحق للموقع و/او انتاجي إيقاف حسابك بشكل مؤقت أو دائم.\n" +
                "يحتفظ الموقع و/او انتاجي بحقه أيضاً في اتخاذ أي إجراءات ضرورية بما في ذلك الإجراءات القانونية المناسبة في حال عدم تسديدك للرسوم المترتبة عليك لصالح الموقع. انتاجي\n" +
                "بالنسبة للحسابات المستحقة لأكثر من 30 يوماً، سيتم إقتطاع قيمة المبلغ الغير مدفوع من حسابك في المحفظة الإلكترونية \"محفظتي\" (MyWallet ) ولا مانع لديك من قيام الموقع و/او انتاجي بذلك حسب الأصول مع ضرورة إبلاغك عبر البريد الإلكتروني بإتمام عملية السحب.\n" +
                "يحتفظ الموقع و/او انتاجي بحقه في إتخاذ أي إجرائات أو خطوات ضرورية و تتضمن كافة الوسائل اللازمة ولا تقتصر على الدعاوى القانونية لتحصيل الرسوم المستحقة و/أو الضرائب والنفقات الملائمة.\n"));

        terms.add(new terms("إستخدام نظام انتاجي للدفع الآمن", "أنت تعلم وموافق على أن الموقع و/او انتاجي سوف يقوم بإ علامك عن أي تعديل على اتفاقية المستخدم، وبموجبه هذه التعديلات فإنه من الممكن أن تتضاعف التزاماتك وفقاً لأي تعديلات قد تجرى على إتفاقية الإستخدام.\n" +
                "يقر ويوافق العميل على أن للموقع و/او انتاجي  وبمطلق صلاحيتهما ودون تحملهما المسؤولية القانونية أن تجري اية تعديلات أساسية أو فرعية على هذه الإتفاقية دون أن يتطلب ذاك موافقة إضافية من طرفك، وذلك في أي وقت وبأثر فوري، ويتم اعلامكم بهذه التعديلات بواسطة بث إعلان على الموقع.\n" +
                "من المعلوم للعميل بأن الموقع لا يعتبر مزاداً أو بنكا ًولا يقدم خدمات مماثلة، وانما هو موقع الكتروني يتم من خلاله بيع وشراء البضائع بين البائعين والمشترين المسجلين بالموقع.\n" +
                "العضوية على الموقع مجانية. و يحق للموقع و/او انتاجي فرض رسوم إبرام الصفقات على البائعين عند بيع بضاعتهم عن طريق الموقع، ومن المعلوم بأن هناك رسوم إعلانات إختيارية في حالة طلبها و إستخدامها لترويج البضائع على الموقع.\n" +
                "يلتزم البائعين بدفع كافة الرسوم المستحقة للموقع خلال 30 يوما بحد أقصى بعد استكمال أي عملية بيع ناجحة.\n" +
                "على البائع أن يبلغ إدارة الموقع حسب الأصول بأي عملية بيع غير ناجحة لأي سبب كان، وسيقوم الموقع بإلغاء العمولة المحتسبة على السلعة .\n" +
                "يحق للبائع إلغاء أو إسترداد قيمة أي عمولات إحتسبت أو خصمت على عمليات لم تتم.\n" +
                "قبل عرضك لأي سلعة لغايات بيعها عن طريق الموقع عليك مراجعة تفاصيل الرسوم المحددة التي سيتم إحتسابها على عملياتك ويترتب عليك سدادها فور إصدار الفواتير الشهرية الخاصة بحساب عملياتك على الموقع،\n" +
                "للموقع الحق بعمل تعديلات على رسوم العمليات بما يراه مناسبا وسيتم الإعلان عن أي تعديل من خلال مراسلتك على بريدك الإلكتروني، و قد تكون التعديلات مؤقتة أو مستمرة سواء كانت على الرسوم أو تفاصيل خدمات الشحن وعليك الالتزام بها وفق بنودها حين يتم الإعلان عنها .\n" +
                "كافة الرسوم تحتسب بالعملة المحلية لموقع البلد الذي سجلت به. وعليك دفع كافة الرسوم المستحقة على عملياتك بالموقع إلى الموقع او انتاجي مضافاً إليها أي ضرائب أو نفقات أخرى، وذلك في غضون 30 يوماً من تاريخ الفاتورة المرسلة من الموقع او انتاجي ، على أن يتم السداد بواسطة الوسائل المعتمدة لذلك.\n" +
                "في حال عدم إلتزامك بدفع الرسوم أو النفقات المحتسبة على عملياتك في الموقع، فإن الموقع و/او انتاجي وبدون أدنى مسؤولية قانونية يحتفظ بحقه في : \n" +
                "إصدار وتوجيه إنذار رسمي لك لعدم إلتزامك بالسداد بالوقت المحدد.\n" +
                "في حال لم يتم سداد المستحقات المالية في مدة أقصاها 7 أيام من تاريخ إصدار الموقع و/او انتاجي للإنذار فيحق للموقع و/او انتاجي كوم إيقاف حسابك بشكل مؤقت أو دائم.\n" +
                "يحتفظ الموقع و/او انتاجيد بحقه أيضاً في اتخاذ أي إجراءات ضرورية بما في ذلك الإجراءات القانونية المناسبة في حال عدم تسديدك للرسوم المترتبة عليك لصالح الموقع. انتاجي \n" +
                "بالنسبة للحسابات المستحقة لأكثر من 30 يوماً، سيتم إقتطاع قيمة المبلغ الغير مدفوع من حسابك في المحفظة الإلكترونية \"محفظتي\" (MyWallet ) ولا مانع لديك من قيام الموقع و/او انتاجي بذلك حسب الأصول مع ضرورة إبلاغك عبر البريد الإلكتروني بإتمام عملية السحب.\n" +
                "يحتفظ الموقع و/او انتاجي بحقه في إتخاذ أي إجرائات أو خطوات ضرورية و تتضمن كافة الوسائل اللازمة ولا تقتصر على الدعاوى القانونية لتحصيل الرسوم المستحقة و/أو الضرائب والنفقات الملائمة.\n"));

        terms.add(new terms("معلوماتك الشخصية ومعلومات تفاصيل العمليات", "يقر ويوافق العميل على منح الموقع و/او انتاجي حقاً غير محدود، وعالمي، ودائم وغير قابل للإلغاء، ومعفي من المصاريف، و مرخص باستخدام معلومات أو مواد شخصية أو غير ذلك، تم تزويدها للموقع للموقع و/أو تم اعلانها على الموقع من خلال عملية تسجيل العميل ، المزايدة، الشراء، أو أثناء عملية عرض البضائع وبيعها، وذلك عبر النماذج المخصصة للتواصل و التسجيل، أو عبر أية رسالة إلكترونية أو أي من قنوات الإتصال المتاحة بالموقع. وذلك بهدف تشغيل وترويج الموقع وفق اتفاقية الإستخدام وإتفاقية سرية المعلومات.\n" +
                "يوافق ويقر العمي بأنه هو الشخص الوحيد المسؤول عن كافة المعلومات التي قام بإرسالها أو نشرها وينحصر دور الموقع و/ انتاجي بالسماح لك بعرض هذه المعلومات على صفحات الموقع ومن خلال قنواته الإعلانية .\n"));

        terms.add(new terms("السلع و المعلومات المحظور تداولها خلال إستعمالك للموقع", "لا يحق لأي مستخدم عرض أي سلعة لا يسمح بالإتجار بها في باسواق المملكة العربية السعودية بحسب الانظمة اللوائح الصادرة عن وزارة التجارة والصناعة و إدارة الجمارك ووزارة الداخلية في المملكة العربية السعودية وكافة الوزارات المعنية ومنها على سبيل المثال لا الحصر:\n" +
                "الأدوية والمستحضرات الغير مرخصة من قبل وزارة الصحة\n" +
                "المواد المتفجرة و الأسلحة النارية\n" +
                "الحيوانات الكائنات الحية الاليفة والبرية و الطيور أو أعضائها\n" +
                "سلع غير مشروعة دينيا\n" +
                "المشروبات الروحية و الخمور و المسكرات ، والتبغ بكافة أنواعه، و الأدوية المخدرة\n" +
                "البرامج والأقراص الليزرية المقرصنة والغير أصلية\n" +
                "أشرطة الفيديو الخلاعية وأي برامج ذات علاقة بالإباحيات\n" +
                "المواد الممنوع تداولها قانونياً\n" +
                "المنتجات من اصل حيواني الغير قانونية\n" +
                "الوثائق و التحف التاريخية الوطنية المسجلة\n" +
                "السندات وتتضمن الأسهم، الصكوك، السندات الجمركية أو أي أدوات مالية\n" +
                "الخدمات و الأعلانات العامة لمواقع أو شركات\n" +
                "القطعة الفنية الممنوع تصديرها خارج المملكة العربية السعودية\n" +
                "القطع الأثرية والكنوز الفنية حسبما هو منصوص عليها في القوانين.\n" +
                "أي سلع مقلدة أو غير أصلية أو معطوبة، مزورة، غير صالحة، أو أنها من خلال استخدامها يمكن أن تلحق أضراراً بمستخدمي موقع آخر في مصالحهم وصحتهم.\n" +
                "الأغذية و السوائل و المواد الكيماوية و الغازية\n" +
                "أي سلع تم الإعلان بشكل رسمي أو غير رسمي من قبل أي جهة حكومية معنية في المملكة العربية السعودية عن عدم السماح ببيعها أو إستيردها أو إستعمالها سواء قبل أو بعد عرضها بالموقع، وللموقع الحق بعدم السماح بعرضها حتى وإن كانت على مسؤولية البائع\n"));

        terms.add(new terms("المحظورات عند عرضك للسلع على الموقع", "عرض سلع مقلدة لماركات مسجلة عالميا أو محليا\n" +
                ".عرض سلع مسروقة أو غير معروفة المصدر أو غير حاصلة على ترخيص بيع رسمي\n" +
                "نشر معلومات أو محتويات أو أخبار غير لائقة ضمن العادات و التقاليد المتعارف عليها\n" +
                "بث معلومات ( بحسب تقييمنا) زائفة، احتيالية، غير صائبة، مضللة، تشهيرية، افترائية، ترهيبية أو مزعجة\n" +
                "نشر ملاحظات، أسئلة أو إجابات تكون غير حقييقية في طبيعتها، بما يتضمن ذلك ولكن لا يقتصر على، التعليقات العنصرية،استخدام اللغة التدنيسية، الاعتداء على مستخدم آخر، إهانة الثقافات الأخرى أو الإقدام على أي تعليقات أخرى مسيئة.\n" +
                "إدراج معلومات أو بضائع من شأنها انتهاك حقوق الملكية الفكرية لطرف ثالث والملكيات الأخرى أو حق السرية.\n" +
                "نشر معلومات قذرة أو فاحشة، والتي تتضمن ولكن ليست مقتصرة على المعلومات الإباحية وأي معلومات (نراها في نظرنا) غير لائقة.\n" +
                "نشر معلومات (في نظرنا) تحمل رأياً سياسياً ناقداً أو ذي محتوى يضر بالمصلحة العامة.\n" +
                "نشر أية معلومات أو محتويات أو إدراج بضائع تكون (في نظرنا) متعدية على الثقافة أو الدين أو التقاليد المحلية.\n" +
                "بث معلومات أو محتويات أو إدراج بضائع (في نظرنا) قد لا تكون متوافقة مع قوانين الشريعة الإسلامية وأحكامها ومبادئها وقيمها وأخلاقياتها وتقاليدها.\n" +
                "نشر معلومات أو محتويات أو إدراج بضائع (في وجهة نظرنا) قد تهدد الأمن الوطني.\n" +
                "نشر معلومات أو محتويات أو إدراج بضائع (في نظرنا) تتضمن أو تشجع على المقامرة.\n" +
                "استخدام كلمات مثيرة أو غير لائقة عند عرض البضائع للبيع باستعمال هذا النوع من الكلمات في أسماء المنتجات أو العناوين، بهدف شد الانتباه أو توجيه الأعضاء لبضاعتك.\n" +
                "الإجراءات المحظورة على مستخدمي الموقع\n" +
                "عدم تسديد ما عليك من دفعات لبضائع قمت بشرائها، ما لم يكن البائع قام بتغيير مواصفات البضاعة أو طرأت مستجدات بعد أن قمت بالمزايدة، أو حدث خطأ مطبعي واضح.\n" +
                "عدم تسليمك لسلعة تم شراؤها منك طالما إلتزم المشتري بالشروط المعلنة.\n" +
                "المحاولة بإتمام صفقات خارج الموقع لسلع عرضت ضمن الموقع أو عرضت للبيع على الموقع بدون تسجيلها كعملية ناجحة بغض النظر عن طريقة التسليم و السداد.\n" +
                "استخدام الاتصالات الناتجة عن عمليات الشراء أو البيع على الموقع، لإنجاز صفقات بيع على بضائع أخرى بشكل مباشر أو غير مباشر من مواقع أخرى عبر البريد الإلكتروني أو غيره من وسائل الإتصال.\n" +
                "الإدعاء بعدم بيع البضاعة، في الوقت الذي يرى الموقع و/او انتاجي من وجهة نظره أنها تمت بنجاح وفق اتفاقية المستخدم وأحكام الموقع.\n" +
                "التلاعب أو محاولة التلاعب على الموقع بأي طريقة بما في ذلك أسعار أي بضاعة أو الخدمات عل الموقع سواء بمفردك أو بمساعدة طرف أخر أو مستخدم آخر\n" +
                "المراوغة والتلاعب في هيكلية رسوم الموقع وعملية الفوترة، أو الرسوم المملوكة انتاجي و/او الموقع.\n" +
                "القيام بأي عمل من شأنه الإخلال بأنظمة حفظ سرية معلومات وبيانات الموقع، أو كشف أو إستعمال إي بيانات أو معلومات لأي أسباب أو أعمال غير متعلقة بانتاجي و/او الموقع. - تحويل حسابك على الموقع واسم المستخدم، إلى طرف آخر دون إبلاغ إدراة الموقع و موافقتها على هذا الإجراء\n" +
                "تحويل حسابك على الموقع واسم المستخدم، إلى طرف آخر دون إبلاغ إدراة الموقع و موافقتها على هذا الإجراء\n" +
                "توزيع أو الإعلان عن اتصالات غير قانونية أو ذات حجم كبير، أو سلسلة رسائل هرمية.\n" +
                "توزيع أي برمجيات مؤذية مثل الفيروسات، أحصنة طروادة، قنابل موقوتة، أو أي برمجيات مشابهة أو تكنولوجيات من شأنها الحاق الضرر بالموقع، أو بمصالح وأملاك مستخدمي الموقع ويتحمل من يثبت عليه هذا العمل كافة التعويضات المالية و المعنوية بدون أدنى مسؤولية على انتاجي و/او الموقع.\n" +
                "اختلاق مطالبة على الموقع و/او انتاجي أو التسبب بخسارة كلية أو جزئية لخدمات مشغلي الإنترنت أو أي مجهزين آخرين.\n" +
                "القيام بأي عمل يحملنا أو قد يحملنا (في وجهة نظرنا) أعباءاً هائلة غير مبررة على بنيتنا التحتية وسياسة التشغيل.\n" +
                "التدخل أو محاولة التدخل للتأثير على سير العمل في الموقع.\n" +
                "محاولة الاستيلاء على حساب مستخدم آخر أو القيام بأي عملية احتيال على الموقع أو حسابات المستخدمين والمجالات الأخرى الخاصة بهم.\n" +
                "تصدير أو إعادة تصدير أي أدوات تخص الموقع باسثتناء ما هو منصوص عليه في القوانين المنظمة للتصدير في أي من التشريعات المعمول بها في مثل هذه الشؤون.\n" +
                "استنساخ، تعديل أو توزيع أي محتوى في الموقع أو خرق حرمة حقوق الطبع أو العلامات التجارية بأي شكل.\n" +
                "انتهاك أي قوانين، أحكام، نظم، إرشادات، حقوق طرف ثالث أو عقود انتاجي.\n" +
                "الإضرار بانتاجي و/او الموقع من خلال إستعمال خدمات الشحن الممنوحة من قبل انتاجي و/او الموقع أو خدمة محفطتي أو خواص أو عقود أخرى أو شروط وبنود تخص انتاجي ، التي تعرض على الموقع بين حين و أخر.\n"));

        terms.add(new terms("تتعهد وتعلن وتضمن أنك انك بلغت 18 عام أو أكثر", "أن لديك السلطة بإلزام المؤسسة \" إذا كنت ممثلاً لمؤسسة \"\n" +
                "أنك أنت المالك المستفيد الوحيد والحصري قانوناً لجميع المواد من أي نوع و ترغب بعرضها للبيع على الموقع، وأن لديك ما يثبت أن لك الحق والسلطة في الاتجار بهذه المواد وعرضها.\n" +
                "أنك سوف تلتزم بكافة القوانين المحلية والدولية المعمول بها في هذا الشأن، بالاضفة الى انك تلتزم بكافة الأحكام المعمول بها بخصوص استخدام الموقع.\n" +
                "إن المعلومات ووصف السلع التي ستنشرها على الموقع بغرض البيع صحيحة ودقيقة ومفصلة ومصورة.\n" +
                "أن تعمل ضمن سياسة الموقع الخاصة بالمحافظة على خصوصية معلومات الإتصال و التواصل، فلن تكشف عن تفاصيل معلومات و عنوانين الإتصال بك بما في ذلك أرقام الهواتف، العناوين البريدية، العناوين الإلكترونية، في أي مكان في الموقع بما في ذلك النماذج و المنتدى و تفاصيل السلعة أو من خلال أي ملامح للبريد الإلكتروني للموقع.\n" +
                "لن تستخدم معلوماتك التي تحصل عليها من خلال الاتصالات اللازمة لإنجاز أي صفقة على الموقع بهدف إتمام عمليات بيع إضافية خارج الموقع أو من خلال موقع آخر.\n" +
                "لن تجمع معلومات عن المستخدمين الآخرين بما في ذلك عناوينهم الإلكترونية ووسائل الاتصال الأخرى.\n" +
                "لن تكشف أو تنشر أي معلومات شخصية عن المستخدمين، أو تقوم باستخدامها بأية طريقة (في نظرنا) قد تنتهك سريتهم وخصوصيتهم والقوانين المعمول بها.\n"));

        terms.add(new terms("حقوق الطبع", "كافة المحتويات التي يتضمنها الموقع، بما في ذلك وليس محصوراً في النصوص، التصاميم الجرافيكية، الشعارات، أيقونات الأزرار، الرموز، المقاطع الصوتية، الأحمال الرقمية، البيانات المجمّعة والبرامج الإلكترونية، هي ملك وحقوقها محفوظة إما لانتاجي دوت كوم أو لمستخدميه، وللمعدين لهذه المحتويات وللمفوضين وهي محمية ضمن حقوق الطبع المحفوظة، والعلامات التجارية وحقوق وقوانين الملكية الفكرية والإبداعية.\n" +
                "المحتويات المجمعة على الموقع هي ملك حصري وحقوقها محفوظة انتاجي ، وهي محمية ضمن حقوق الطبع المحفوظة، والعلامات التجارية وحقوق وقوانين الملكية الفكرية والإبداعية.\n"));

        terms.add(new terms("العلامات التجارية", "انتاجي والشعارات المملوكة، والكلمات والشعارات الأخرى على الموقع، بما في ذلك \"ماي واليت\" و\" انتاجي سيف باي\"-الدفع الامن هي إما علامات تجارية مسجلة أو غير مسجلة انتاجي ، وهي محمية بحقوق وقوانين ملكية العلامات التجارية الدولية والفكرية الاخرى.\n" +
                "علامات انتاجي التجارية قد لا يتم استخدامها لمنتجات أو خدمات خارج السوق أو من شأنها أن تؤثر من قيمته ومصداقيته. كل العلامات التجارية الأخرى غير المملوكة انتاجي والتي تظهر على الموقع هي ملكية لأصحابها، والذين قد يكونوا أو لا يكونوا تابعين أو مرتبطين أو مرعيين من انتاجي.\n"));

        terms.add(new terms("الأضرار بانتاجي", "لا بد من ان يتم الإبلاغ عن أية مشاكل من أي نوع يخص إنتهاكا لاتفاقية المستخدم هذه في الموقع.\n" +
                "إذا ما اعتقدت أن حقوق ملكيتك الفكرية قد انتهكت، ينبغي عليك إبلاغ الموقع و/ انتاجي بذلك.\n" +
                "إذا ثبت البند رقم 2 أعلاه فقد يلجأ الموقع و/او انتاجي دون الاضرار بمصالحه وحقوقه المترتبة، أن يحديد أو يوقف أو يحجب وصول مستخدم إلى موقع و/أو إلغاء عضويته في الموقع، أو إزالة ما له من محتويات على الموقع.\n" +
                "كذلك يمكن للموقع و/ انتاجي اللجوء الى خطوات تقنية و/أو قانونية ضد المستخدمين الذين يختلقون مشاكل أو مطالبات قانونية من أي نوع، كانتهاك حقوق الملكية الفكرية لأطراف ثالثة أو التعامل بطرق غير لائقة مع اتفاقية المستخدم هذه أو مع عقودنا.\n" +
                "يمنع عرض عناوين وصلات لمواقع أخرى خارج الموقع و إن كانت تخص السلعة المعروضة على الموقع ويتحمل من عرض العنوان على أية أضرار قد تنجم عن دخول فيروسات أو برمجيات مؤذية سواء انتاجي و/او للموقع أو أي من مستخدمي\n"));

        terms.add(new terms("حماية المشتري و سياسة الارجاع", "الموقع او انتاجي لا يضمن لك سلامة المنتج او أي اضرار تنتج عن عملية شراء من أي بائع. .\n" +
                "في حال قام المشتري بشراء بضاعة ولم يتسلم بضاعته أو أنه تسلم بضاعة تختلف عن ما تم ذكره بصفحة العرض أو متضررة أو لاتعمل بالشكل الصحيح، حينها يمكن للمشتري طلب الحماية من انتاجي ويقم الموقع بتخاذ الاجرات. ولكن لا يضمن لك استرجاع المبلغ بالكامل...\n" +
                "وفي حالة تقرر (من جانب الموقع و/او انتاجي) أن البائع هو من قام متعمداً بالاحتيال على المشتري فإن الموقع و/او انتاجي قد تلجأ لوقف أو إلغاء أو حجب وصول البائع إلى الموقع و/أو إلغاء عضويته، وللموقع الحق بتحميل البائع تكاليف تعويض المشتري وتكاليف الشحن والتسليم بحسب (بو الص الشحن و وأي رسوم إضافية )، ويحتفظ الموقع و/ انتاجي بحقه في اتخاذ خطوات إضافية إذا ما كانت ضرورية، بما في ذلك الخطوات القانونية.\n" +
                "يقر ويوافق العميل على أنه في حال إرجاع أي سلعة من المشتري إلى الموقع، وكانت هذه السلعة غير مشروعة أو غير قانونية، فإنه يحق للموقع و/او انتاجي حينها ودون أدنى مسؤولية عليه أن يتلف البضاعة أو أن يتخذ أي خطوات ضرورية أخرى.\n"));

        terms.add(new terms("الموافقة على الطلبات و الغائها", "يحتفظ الموقع بالحقّ في رفض أو إلغاء أية طلبية لأي سبب كان. ويحق للبائع تأكيد أو رفض طلب البيع من جهته ، و قد نطلب من المشتري تقديم معلومات أو ثبوتيات إضافية، بما في ذلك ولكن ليس على سبيل الحصر، رقم الهاتف و تفاصيل العنوان ، و معلومات اضافية و مفصلة عن طريقة الدفع و المستندات المتعلقة بها ، كما ويحق للموقع الغاء طلب الشراء في حال عدم تجاوب المشتري بالرد على الاتصالات الهاتفية لتأكيد طلبه من قبل ادارة الموقع أو شركاء الشحن ولايحق له مطالبة الموقع بتأكيد الطلب بعد الغائه أو طلب اعادة ارساله بعد ارجاعه من قبل شركة الشحن . \n" +
                "جميع الطلبات المدفوعة بخدمة ( الدفع عند الاستلام ) غير ملزمة للموقع حتى يتم تأكيدها من قبل الموقع أو من قبل البائعين ويحتفظ الموقع بالحق بالغاء اي طلبات غير مؤكدة في حال مرور مدة 14 يوم أو أكثر من تاريخ طلب الشراء\n"));

        terms.add(new terms("البضائع المرتجعة", "يحق للموقع و/او انتاجي واي من الشركات التابعة لها أن تقوم بالتخلص أو اتلاف أو تصفية أو ان تعرض بالمزاد أي من السلع/المنتجات التابعة البائع وكما تراه مناسباَ وذلك خلال ستين يوماً بعد استلامها من شركة الشحن في حال تم ارجاع أو عدم استلام هذه المنتجات/السلع من المشترين لأي سبب كان، شريطة ان يتم اشعار البائع عن المنتجات المذكورة/السلع التي تم ارجاعها عن طريق ارسال رسالة الى البريد الالكتروني المزود من البائع ولم يقم البائع باتخاذ الاجراءات اللازمة لاستلامها. تعتبر هذه الفقرة تفويض صريح للموقع و/او لانتاجي لاتلاف و/او عرض المنتجات في التصفية لأي منتجات/سلع مذكورة أعلاه وبدون أي اعتراض من البائعين وبدون أي مسؤولية مترتبة على الموقع و/او انتاجي. علاوة على ذلك، يحق للموقع و/او لانتاجي ان تقوم بخصم من حساب البائع او مطالبته بأي رسوم أو مبالغ قد تتكبدها من خلال الاتلاف و/أو تصفية السلع المذكورة أعلاه ."));

        terms.add(new terms("مسؤولية انتاجي", "الموقع هو مجرد قناة للتواصل، حيث يمكن للمستخدمين الالتقاء والتفاعل مع بعضهم البعض بهدف بيع وشراء البضائع\n" +
                "انتاج ييمكن لل موقع و/او انتاجي أن يكون طرفاً في أي صفقة وهو غير ملزم باي طريقة كانت بالنيابة عن أيا من البائع أو المشتري المستخدمين للموقع.\n" +
                "لا يضمن الموقع و/او انتاجي بأن المشتري أو البائع سوف سوف يقوموا باتمام الصفقة أو يقبل البائع بإرجاعها أو بإعادة ثمنها.\n" +
                "يقر ويوافق العميل بأنه لن يحمل الموقع و/او انتاجي اية مسؤولية يقوم بها المستخدمين بخصوص المحتوى، الأفعال، ردود الأفعال، البضائع أو المعلومات التي يعرضونه\n" +
                "ان الموقع و/او انتاجي غير مسؤولين نهائيا عن عدم التقيد أو إبرام عقد يتم بين (المستخدمين، بالاضافة ال انه غير مسؤول عن نقل الملكية القانونية لاية بضاعة من البائع إلى المشتري). حيث أن عقد بيع أي بضاعة سيكون ثنائياً بين البائع والمشتري. و ليس للموقع و/او انتاجي في أيوقت من الاوقات الحق او السلطة او المصلحة في أية بضاعة، وليس على الموقع و/او انتاجي اي التزام او مطالبات بشأن تلك البضاعة المبرم بخصوصها عقد بين البائع والمشتري.\n" +
                "ان الموقع و/او انتاجي غير مسؤولين نهائيا عن أي أداء غير مرض أو متاخر من قبل أي من الطرفين، ولا عن أي خسارة ، أعطال أو تأخير، بسبب بضاعة غير متوفرة أو تأخر تسليمها.\n" +
                "ان الموقع و/او انتاجي ليس مطلوب منهم نهائيا منهم التوسط أو حل أي نزاع أو إشكال بين المستخدمين.\n" +
                "لا يتحكم ولا يضمن الموقع و/او انتاجي النوعية والأمان والمشروعية لأي بضاعة يتم الإعلان عنها، بالاضافة الى انه لا يتحكم في صدق المستخدمين بخصوص مضمون البضاعة او ما يدرجونه ضمن وصف سلعهم، ولا في قدرة الباعة على تسويق بضاعتهم، ولا تسديد المشتري أثمان البضائع.\n" +
                "لا يضمن الموقع و/او انتاجي المواصفات النوعية ولا قيمتها ولا مدى رواجها في الأسواق وهي مسؤولية البائع و المشتري للتأكد من كافة البضائع قبل بيعها\n" +
                "انتاجي او موقع ليس موردا أو مصنعا لأي نوع من البضاعة التي تباع أو تشترى على الموقع.\n" +
                "لا يمثل أو يضمن الموقع و/او انتاجي مواصفات المستخدمين لناحية مشروعيتهم ومصداقيتهم وهويتهم.\n" +
                "ان الموقع و/او انتاجي غير مسؤولين نهائياً عن مستوى أمانلأي روابط إلكترونية (لينك) تكون خارج الموقع و إن تم عرض عنوان الرابط على صفحات الموقع لغايات عرض سلعها على صفحات طراف ثالث، وإن الموقع لا يضمن خلوها من الفايروسات أو أي وسائل تدميرية، ا وأن العميل يقر و يوافق أن الموقع و/او انتاجي غير مسؤولين نهائياً عن المحتوى أو تواجد مثل هذه االروابط على الموقع .\n" +
                "يجب على المستخدمين وحدهم الإتفاق فيما بينهم على طريقة وشروط وبنود التسليم، التسديد، فيما بينهم، حيث أن الموقع و/او انتاجي لا يتحملون أية مسؤولية بخصوص هذه الترتيبات، وان الموقع انتاجي يقدمان فقط خدمات إختيارية للشحن و تسهيل الدفع .\n" +
                "لا يتحمل الموقع و/او انتاجي أية مطالبات تنشأ عن أخطاء أو إهمال، سواء حصلت قدرا أو من طرف ثالث.\n" +
                "انتاجي الموقع يستثني من ضماناته و بنوده وشروطه أي خسارات مالية، تشويه في السمعة، وأي أضرار خاصة تنشأ عن سوء استخدامك أو عدم قدرتك على استخدام الموقع، وان الموقع و/او انتاجي لا يتحملون أي مسؤوليات أو مطالبات في مثل هذه الحالات.\n" +
                "يقر ويوفق العميل على أن يعفي الموقع و/او انتاجي و/أو أي من مسؤوليه وممثليه، بشأن أي مطالبة، نزاع، تكاليف، أضرار، ومسؤولية، وأي خسارة مباشرة لأي طرف نشأت عن فعل قام به مستخدمو الموقع، كما ويتنازل العميل تنازلأ نهائيا لا رجعة فيه وفق القوانين المعمول بها عن أي مطالبة في هذا الشأن.\n"));

        terms.add(new terms("السرية", "يتخذ الموقع معايير (فيزيائية وتنظيمية وتكنولوجية) للحماية من وصول شخص غير مفوض إلى معلومات هويتك الشخصية، وحفظها. مع العلم أن الانترنت ليس وسيلة آمنة، وسرية معلوماتك الشخصية لا يمكن أن تكون مضمونة 100% .\n" +
                ".\n" +
                "الموقع و/او انتاجي ليس لهم السيطرة على أفعال أي طرف ثالثة، مثل صفحات الانترنت الأخرى الموصولة بهذا الموقع، أو أطراف ثالثة تدعي أنها تمثلك اوتمثل اخرين. انت تعلم وموافق أن الموقع و/ انتاجي  قد يستخدم معلوماتك التي زودته بها، بهدف تقديم الخدمات لك في الموقع انتاجي ، ولإرسال رسائل تسويقية لك، وان عقد السرية في هذا الموقع يضبط عمليات الجمع والمعالجة والاستخدام والتحويل لمعلومات هويتك الشخصية.\n"));

        terms.add(new terms("نقض اتفاقية المستخدم", "إن الموقع و/او  انتاجي  وبحسب اتفاقية المستخدم وبحسب الانظمة و القوانين قد يلجأ حالاً وبدون تحمله المسؤولية إلى تحديد نشاطك، وإزالة عروضك وشطب قوائم بضاعتك المعروضة للبيع، وإنذار المستخدمين الآخرين بشأن نشاطاتك، وقد يلجأ الموقع و/او انتاجي كذلك إلى وقف مؤقت أو دائم، تحديد أو سحب عضويتك و/أو تحديد أو إلغاء وصولك إلى الموقع دون الإضرار بحقوقه الأخرى ووسائله المشروعة في استرداد حقوقك في حالة :\n" +
                "إذا انتهكت اتفاقية الإستخدام\n" +
                "إذا لم يكن بإمكان الموقع و/او انتاجي  توثيق أي من معلوماتك المقدمة إليه.\n" +
                "إذا قرر الموقع و/او انتاجي أن نشاطاتك قد تتسبب لك أو لمستخدمين آخرين و للموقع و/او انتاجي في إشكالات قانونية.\n" +
                "قد يلجأ الموقع و/او انتاجي \"بحسب تقيمه\" إلى إعادة نشاط المستخدمين الموقوفين، حيث أن المستخدم الذي اوقف نشاطه نهائياً أو سحبت عضويته، قد لا يكون بإمكانه التسجيل أو محاولة التسجيل في الموقع، أو استخدام الموقع بأي طريقة كانت مهما كانت الظروف، لحين السماح له بإعادة نشاطه في انتاجي الموقع. ومع ذلك فإنك إن قمت بانتهاك اتفاقية المستخدم هذه، فإن الموقع و/او انتاجي يحتفظ كل منهم بحقه في استعادة أية مبالغ مستحقة لانتاجي عليك، وأي خسارات وأضرار تسببت بها، وللموقع و/او ل انتاجي الحق بإتخاذ الإجراءات القانونية و/أو اللجوء لمحاكم المملكة العربية السعودية لرفع قضية جنائية ضدك حسبما يراه الموقع و/او انتاجي مناسباً.\n" +
                "إن قيامك أو قيام آخرين بانتهاك اتفاقية المستخدم هذه لا يلزم الموقع و/او انتاجي بالتنازل عن حقه في اتخاذ الإجراءات المناسبة لمثل هذا الفعل ولغيره من أفعال الانتهاك المشابهة. والموقع و/او انتاجي لا يضمن اتخاذه إجراءات ضد كل الانتهاكات لاتفاقية المستخدم.\n" +
                "على المشتري أن يقوم بإضافة تقييم عن البائع بشكل منصف فور إستلام السلعة.\n"));

        terms.add(new terms("تزويد معلومات استرجاعية", "انتاجي يشجع المشترين على الموقع لإعطاء نقييمهم للبائعين و المنتجات عقب إتمام كل عملية بيع، فهذا من شأنه مساعدة جميع المستخدمين للتعرف على البائعين المحتملين، وسوف تعرض معلوماتك الاسترجاعية مع هوية المستخدم على الموقع، وأنت موافق على عدم نشر معلومات استرجاعية تحوي تهجمات عنصرية أو انتقاص من القيمة الثقافية وأي تعليقات تهكمية، كما يمنع نشر معلومات استرجاعية بهدف الترويج لمبيعات خارج الموقع. وفي حال استمرارك بتلقي معلومات استرجاعية سلبية فإن الموقع و/او انتاجي سيباشر إلى الغاء عضويتك على الموقع"));

        terms.add(new terms("الغاء الوصول و-أو العضوية", "بدون الحاق الضرر بحقوقه الأخرى ووسائله المشروعة لاسترداد حقوقه، يمكن للموقع و/او انتاجي وقف أو إلغاء عضويتك و/أو وصولك إلى الموقع في أي وقت وبدون إنذار ولأي سبب، ودون تحديد، ويمكنه الغاء اتفاقية المستخدم هذه."));

        terms.add(new terms("تحديد المسؤوليات", "بحسب ما هو مسموح في القانون فإن الموقع و انتاجي وموظفيهم ومدرائهم ووكلائهم والمتفرعين عنهم والمجهزين له لن يكونوا مسؤولين عن أي خسارة مباشرة أو أعطال تنشأ عن استخدامك للموقع. إذا لم تكن راض عن الموقع أو عن أي من محتوياته مواده فالحل و هو بعدم استمرارك باستخدامه، علاوة على ذلك فأنت موافق أن اي استخدام غير مفوض للموقع وخدماته، بسبب إهمالك سوف يتسبب بالحاق الأذى بالموقع و/او انتاجي ، وعليه سيضطر الموقع و/او انتاجي حينها اللجوء إلى بنود وشروط اتفاقية المستخدم."));

        terms.add(new terms("الأمان", "أنت موافق على توفير الأمان للموقع و/او انتاجي ومدرائهم وموظفيهم ووكلائمه ومجهزيهم ووقايتهم من أي ضرر قد يلحق بهم جراء مطالبات وخسائر وأعطال وتكاليف ونفقات، تحدث بسبب انتهاكك لاتفاقية المستخدم أو خرقك لأي قانون أو تعديلات او تعدي على حقوق أطراف ثالثة."));

        terms.add(new terms("العلاقة والإشعارات", "لا تتضمن أي من بنود اتفاقية المستخدم إشارة إلى وجود شراكة بينك وبين الموقع و/او انتاجي ، وأنت ليس لك سلطة في إلزام الموقع و/ انتاجي بأي حال من الأحوال، وأن أي إشعارات تود إرسالها للموقع و/او انتاجي ، عليك إرسالها بالبريد الإلكتروني، على أن يقوم الموقع و/او انتاجي بالرد على الرسالة الإلكترونية. أنت تعرف وموافق على أن أية إشعارات ترسل إليك من الموقع و انتاجي سوف تعلن على الموقع أو بواسطة البريد الإلكتروني الذي زودتنا به خلال عملية التسجيل، ويفترض أنك تسلمته بعد 72 ساعة من الإرسال. ويمكن أن نرسل لك إشعاراً بالبريد العادي على العنوان الذي زودتنا به ويفترض وصوله إليك بعد 7 أيام من الإرسال."));

        terms.add(new terms("تحويل الحقوق والإلتزامات", "يقر ويوافق المستخدم على منح الموقع و/ انتاجي الحق في تحويل جزء أو كل حقوقه ومنافعه والتزاماته ومسؤولياته، إلى أطراف أخرى تعمل معه، دون الحاجة للرجوع إليك، وذلك بحسب نصوص اتفاقية المستخدم، والموقع و/ انتاجي ملتزمين بإشعارك عن مثل هذه التحويلات إذا حصلت وكذلك بالنشر على الموقع، في حين أنك لا تستطيع تحويل منافعك وحقوقك والتزاماتك لطرف ثالث دون أخذ إذن مكتوب سلفاً من الموقع و/ انتاجي ، وذلك وفق الشروط والبنود في اتفاقية المستخدم."));

        terms.add(new terms("معلومات عامة", "إذا كانت أية فقرة واردة في اتفاقية المستخدم هذه غير صالحة أو ملغاة أو أنها لأي سبب لم تعد نافذة، فإن مثل هذه الفقرة لا تلغي صلاحية بقية الفقرات الواردة في الاتفاقية. هذه الاتفاقية (والتي تعدل بين حين وآخر بحسب بنودها) تضع كافة الخطوط العريضة للتفاهم والاتفاق بينك وبين الموقع و/او انتاجي مع الاعتبار لما يلي :\n" +
                "ليس من حق أي شخص لا يكون طرفاً في اتفاقية المستخدم هذه أن يفرض أية بنود أو شروط فيها.\n" +
                "إذا تمت ترجمة اتفاقية المستخدم لأي لغة أخرى غير الإنجليزية، سواء على الموقع أو بطرق أخرى، فإن النص العربي لها يظل هو السائد.\n"));

        terms.add(new terms("القانون والتشريع الحاكمان", "اتفاقية المستخدم هذه محكومة ومصاغة بحسب قانون المملكة العربية السعودية، وهي خاضعة تماماً وكلياً للتشريع المعمول به في المحاكم المملكة العربية السعودية، هذه الفقرة توجد بديلاً يتم اللجوء إليه في حال انتهاء مفعول اتفاقية المستخدم هذه أو الغاؤها لأي سبب كان."));

        terms.add(new terms("سياسة الإدراج للعطور", "لا يسمح بإدراج عينات العطور (الزجاجات التي عادة ما تحتوي على كميات قليلة من العطر تستخدم لتزويد المستهلكين بعينات مجانية) أو بيعها على الموقع. أي عطر لديه أي من أو كافة الأمور التالية سيتم إعتباره كعينة عطر:\n" +
                "تأتي من المصنع الأصلي كزجاجة عينة للعطر (للمعاينة، البيع من تاجر لتاجر) من المصمم الأصلي للعطر\n" +
                "يأتي بعلبة تغليف مختلفة كالتغليف من المستخدم نفسه (عادة زجاجة عينة العطر تكون مغلفة بعلبة سادة بلون واحد)\n" +
                "يأتي العطر بدون غطاء الزجاجة داخل العلبة.\n" +
                "بعض زجاجات عطر العينة تحتوي على كلمة \" tester\" أو \"demonstration\" على الزجاجة.\n" +
                "العلبة موصوفة بأنها \"ليست للبيع\"\n" +
                "تأكد من أن سلعك من العطور تتبع السياسة أعلاه. إذا لم تكن كذلك، فقد يتم إزالة العرض الخاص بك فوراً دون سابق إنذار و قد تخضع لمجموعة أخرى من الإجراءات كقيود على امتيازات مبيعاتك و مشترياتك و تعليق حسابك.\n"));

        terms.add(new terms("شروط الكفالة واحكامها", "لا تكون الكفالة سارية المفعول إلا في حالة وجود الرقم التسلسلي للسلعة. يحتفظ الموثع و/او انتاجي بحق إلغاء الكفالة في حال تًبيُن قيام المشتري بتعديل أو إزالة الرقم التسلسلي للسلعة بعد شرائها. \n" +
                "\n" +
                "عند سريان مفعول الكفالة، فإن واجبات وإلتزامات الموقع و/او انتاجي تتلخص بتصليح أو إستبدال الجزء المتضرر من السلعة، تعويض المشتري بجزء/ أو بالمبلغ الكلي الذي قام المشتري بدفعه ثمناً للسلعة ويكون التعويض بحسب سعر السلعة في السوق المحلي . \n" +
                "\n" +
                "الصيانة المشمولة بالكفالة لا بد من أن تتم بداخل مركز الصيانة المعتمد من قِبل الموقع و/او انتاجي. ان محاولة صيانة السلعة خارج هذا المركز تؤدي الي الغاء الكفالة بالكامل ولايكون الموقع و/او انتاجي مسؤولا بأي شكل عن تعويض المشتري عن السلعة المتضررة جراء هذه الصيانة، كما ولا تكون مسؤولة بأي شكل ايضاً عن أية دعاوي أو أضرار قد تنشأ من الصيانة خارج مراكز الصيانة المعتمدة من قِبلها. الكفالة لا بد من أن تتم في مركز الصيانة المعتمد لدى الموقع و/او انتاجي. تعتبر الكفالة لاغية في حال محاولة أي نوع من الصيانة تتم خارج المركز المعتمد، ولا يكون الموقع و/او انتاجي مسؤولة عن أية أضرار، تعويضات أو دعاوى تنتج عن صيانة السلعة خارج المركز المتعمد للصيانة. \n" +
                "\n" +
                "إن صيانة أو حتى إستبدال السلع التي تتم وفقاً لشروط واحكام الكفالة لا ولن تعتبر أو تؤدي إلى تجديد مدة الكفالة لاتعتبر الصيانة أو الإستبدال بأي صورة تجديداً لمدة الكفالة التي تم منحها للمشتري مع السلعة. \n" +
                "\n" +
                "لا تغطي كفالة الموقع و/او انتاجي أياً من الحالات التي يتبين فيها أن ضرر السلعة هو خطأ في التصميم، الخامة أو أية عيوب مصنعية أخرى.\n"));

        terms.add(new terms("يستثنى من الكفالة كل مما يلي", "الفحص الدوري، الصيانة العامة، التصليح وإستبدال أجزاء السلعة التي تتعطل نتيجة الإستخدام الطبيعي للسلعة، بالإضافة إلى الأجزاء الإستهلاكية الأخرى كالبطاريات، الكوابل وسماعات الرأس والأضواء وغيرها من أجزاء السلعة التي يتم إستهلاكها بشكل طبيعي.\n" +
                "الإستخدام الخاطئ الذي يشمل - على سبيل المثال لا الحصر- الأعطال التي تنشأ عن عدم معرفة المشتري بالطريقة الصحيحة لعمل السلعة، أو محاولة تشغيلها بما يتعارض مع سياسة الموقع و/او انتاجي أو الجهة المصنعة، بالإضافة إلى الأعطال الناتجة عن إستخدام أية ملحقات غير معتمدة ليتم إستخدامها مع السلعة.\n" +
                "أي عطل ينشأ نتيجة خطأ في التركيب أو التثبيت ينتج عنه خرق للتعليمات الواردة في دليل المستخدم أو تلك التي منحهاالموقع و/او انتاجي للمشتري عند شرائه للسلعة.\n" +
                "كل الأعطال الناتجة عن الحوادث المختلفة مثل الصواعق، القضاء والقدر، الفياضانات والإضطرابات المدنية أو غيرها من الأسباب التي تكون خارجة عن إرادة تاموقع و/او انتاجي ولا يمكن التحكم فيها.\n" +
                "الأعطال التي تنتج عن تعديلات على السلعة لتتناسب مع المعايير الدولية أو المحلية في كل المناطق التي تباع فيها سلع لم تكن مصممة في الأصل لتعمل فيها.\n" +
                "أعطال البطاريات الناتجة عن الشحن المفرط أو أية أسباب أخرى تم فيها خرق التعليمات العامة للإستخدام والموجودة في دليل المستخدم، بالإضافة إلى قيام المشتري بمسح، إزالة أو التعديل على الرقم التسلسلي للسلعة أو في حال كان الرقم التسلسلي للسلعة لا يمكن قراءته.\n" +
                "أعطال البطارية التي تنشأ عن إستخدام شواحن غير متوافقة مع السلعة أو التي لم يتم إعتمادها للعمل مع السلعة من قِبل الجهة المصنعة للسلعة، أو في حال تبين وجود كسر أو عبث بأجزاء من البطارية.\n" +
                "هذه الكفالة غير قابلة للنقل من شخص لآخر، كما أنها ستكون الوسيلة الوحيدة التي يمكن للمشتري من خلالها الإستفادة من خدمات الموقع و/ انتاجي أو مراكز الصيانة المعتمدة لديها والموجودة في وثيقة الكفالة والتي ستكون مسؤولة عن أي خرق صريح أو ضمني لأي من بنود هذه الكفالة.\n" +
                "المسؤولية القانونية: لا تكون انتاجي مسؤولة بأي شكل من الأشكال عن أي ضياع للمعلومات التي قد تكون مخزنة/ محفوظة على أي من السلع التي تتم صيانها أو إستبدالها.\n"));

        terms.add(new terms("سياسة البيع على الموقع", "بمجرد التسجيل على الموقع يعتبر جميع البائعين قد أقروا بالموافقة و التقيد بآلية و سياسة و شروط البيع على الموقع \n" +
                "\n" +
                "كيفية البيع على الموقع\n" +
                "رسوم البيع على الموقع\n" +
                "آلية و سياسة البيع و أسئلة متكررة وهامة لجميع البائعين\n"));

        terms.add(new terms("شروط إضافية للبائعين خلال الجمعة البيضاء", "نطبق هذه الشروط الإضافية على البائع بالإضافة إلى الشروط و الأحكام الأساسية، و يمكنك إيجاد نسخة الشروط و الأحكام الأساسية على موقع انتاجي. سيجري حدث الجمعة البيضاء خلال نهاية شهر نوفمبر 2015 أو أي مدة زمنية ممتدة. انتاجي لديها الحق في تغيير او تعديل أو سحب هذه الشروط الإضافية في أي وقت ومن دون إعلام البائع. ستعمل انتاجي على نشر هذه الشروط الإضافية و أي تعديلات عليها على الموقع مع اعتبار ذلك بلاغ للبائع.\n" +
                "\n" +
                "1- توصيل البضائع الخاضعة للخصومات: يتوجب على البائعين المشاركين في الجمعة البيضاء توصيل البضائع المطلوبة من أي مشتري الى أقرب موقع شحن كيو إكسبرس أو أرامكس أو الى موقع أي شريك شحن آخر. يجب أن تتم عملية التوصيل لكافة المنتجات الخاصعة للعرض خلال 48 ساعة من وقت إتمام الطلبية على الموقع من المشتري.\n" +
                "\n" +
                "\n" +
                "2- ضمان الجودة و الثقة: تشترط الأحكام على البائع ضمان بضائع أصلية وجديدة وخالية من أي خلل. ستعمل انتاجي على اتخاذ الإجراءات القانونية اللازمة و/أو الإجراءات القضائية ضد أي بائع تم اكتشاف بيعه أو توصيله للمشترين بضائع مزيفة أو مستعملة أو مجددة أو ناقصة أو غير أصلية أو غير مرخصة و مضللة. يحق لانتاجي اجراء اختبارات و فحص لعينات من بضائع البائع الخاضعة للخصومات بمساعدة من خبراء أو السلطات المختصة خلال هذه الفترة. على البائع ضمان تجريد انتاجي وموظفيها و وكلائها و المشترين على الموقع من أي اتهامات و ضياع لأي شيء في حال اكتشاف قيام البائع بخرق التعهد. بموجب هذه الشروط الإضافية، سيتم تغريم البائع لصالح انتاجي أو المشتري غرامة مالية أقصاها 50،000 $ (خمسون ألف دولار أمريكي) أو خسائر تراكمية مباشرة لانتاجي و المشتري.\n" +
                "\n" +
                "\n" +
                "3- على البائع تأكيد امتلاكه لرخصة تجارة أو تسجيل تجاري للتجارة و بيع البضائع في المملكة العربية السعودية، و في حال عدم توفر ذلك لن يتمكن البائع من المشاركة في عروض الجمعة البيضاء.\n" +
                "\n" +
                "\n" +
                "4- يتوجب على البائع التأكيد و الموافقة على أن كافة البضائع الخاضعة للعرض خلال حدث الجمعة البيضاء ستكون محجوزة لصالح انتاجي و يجب أن تتوفر المنتجات و أن تكون كافية لتلبية جميع الطلبات خلال الفترة المعنية.\n"));


        FirebaseDatabase.getInstance().getReference()
                .child("terms")
                .child("terms_and_conditions")
                .child("ar")
                .setValue(terms);*/
      //  pol();
    }

    private void pol(){
        ArrayList<terms> terms = new ArrayList<>();

        terms.add(new terms("مقدمة", "تعنى (سياسة الخصوصية) لدينا بطريقة جمعنا وحفظنا واستخدامنا وطريقة حماية معلوماتك الشخصية ومن المهم ان تقوم بالإطلاع سياسة الخصوصية هذه. ونقصد بالمعلومات الشخصية هي المعلومات التي ترتبط بشخص معين والتي تستخدم في التعريف عنه.\n" +
                "نحن لا نأخذ بعين الاعتبار أي معلومات مجهولة المصدر لانها لا تصلح في تشكيل معلومات شخصية ولكننا نقوم بجمع المعلومات الشخصية من الراغبين بإستخدام موقع انتاجي com او صفحات الانترنت المرتبطة (بما في ذلك وعلى سبيل الحصر بيعك وشرائك لبضائع او حين تتصل هاتفيا او بواسطة البريد الالكتروني بفريق مركز دعم المستخدمين لدينا). وبمجرد تزويدك لنا بمعلوماتك الشخصية تكون قد فوضتنا لمعالجة هذه المعلومات وفق بنود وشروط (سياسة الخصوصية) .\n" +
                "قد نقوم بتعديل (سياسة الخصوصية) في اي وقت وذلك من خلال الإعلان عن هذا التعديل بنشر النسخة المعدلة على الموقع. وتكون النسخة المعدلة من (سياسة الخصوصية) سارية المفعول اعتبارا من تاريخ نشرها. في اعقاب النشر يعتبر استمرارك في استخدام الموقع موافقة منك بالشروط والبنود الواردة في النسخة المعدلة لطريقة معالجتنا وتعاملنا مع معلوماتك الشخصية التي كنت قد زودتنا بها.\n" +
                "نأمل منكم الإطلاع على الموقع من حين لأخر للإعلانات عن اية تعديلات على سياسة الخصوصية.\n" +
                "تغطي (سياسة الخصوصية) المواضيع التالية:\n"));

        terms.add(new terms("جمعنا لمعلوماتك الشخصية", "كجزء من التسجيل على الموقع أو استخدامه سوف يطب منك تزويدنا بمعلومات شخصية محددة مثل اسمك وعنوان الشحن وبريدك الالكتروني و/أو رقم هاتفك ومعلومات اخرى مشابهة وبعض المعلومات الاضافية عنك مثل تاريخ ميلادك أو اي معلومات محددة لهويتك. إضافة إلى ذلك وبهدف توثيقنا لهويتك قد نحتاج منك أن تقدم لنا اثبات ساري المفعول يثبت هويتك (مثلا نسخة عن جواز سفرك وتاشيرة او تصريح الاقامة والهوية الوطنية و/ أو رخصة القيادة).\n" +
                "قد نحتاج ايضا الى جمع معلومات مالية محددة منك، مثلا بطاقتك الائتمانية و/أو تفاصيل حسابك المصرفي .\n" +
                "3. يجب عليك ادخال هذه المعلومات المالية في قسم \"حسابي\" على الموقع. وسوف نستخم هذه المعلومات لغايات اصدار الفوانير واسنكمال طلباتك. عند تسجيلك في الموقع، ينبغى عليك عدم نشر اي معلومات شخصية (بما في ذلك اي معلومات مالية) على اي جزء من الموقع باستثناء جزء\" إدارة الحساب\" وهذا من شأنه حمايتك من امكانية تعرضك للاحتيال او سرقة معلومات هويتك. كما ان نشرك لأي من معلوماتك الشخصية على اي جزء من الموقع باستثناء\"حسابي\" قد يؤدي الى ايقاف استخدامك للموقع .\n" +
                "4. سوف يتم جمع معلومات عن عملياتك وأنشطتك على الموقع سواء كانت عملية شراء أو بيع سلع.\n" +
                "الرجاء ملاحظة اننا قد نستخدم عنوان برتوكول الانترنت خاصتك او (IP) وهو(رقم فريد يتم تعيينه لخادم الكمبيوتر أو مزود خدمة الإنترنت الخاص بك أوISP)) ) لتحليل انشطتك وتحسين إدارة الموقع.\n" +
                "قد نجمع معلومات اضافية حول جهاز الكمبيوتر الخاص بك (على سبيل المثال نوع المتصفح) ومعلومات التصفح (على سبيل المثال الصفحات التي تزورها على الموقع) بالإضافة إلى عدد المرات التي تستخدم بها الموقع.\n" +
                "\n" +
                "أخيرًا، قد نجمع معلومات إضافية منك أو عنك بطرق أخرى غير موصوفة هنا تحديدًا. على سبيل المثال، قد نقوم بجمع المعلومات المتعلقة بتواصلك مع فريق دعم العملاء أو من خلال اجابتك على الاستبيانات. قد نجمع أيضًا التقييمات والتعليقات الأخرى المتعلقة باستخدامك للموقع. عندما نقوم بتجميع المعلومات الشخصية للأغراض الإحصائية، يجب أن تكون أسماء أصحاب المعلومات مجهولة.\n"));

        terms.add(new terms("استخدامنا لمعلوماتك الشخصية", "نقوم بمشاركة معلوماتك الشخصية كما هو موضح أدناه فقط مع والشركات التابعة لها انتاجي\n" +
                "نستخدم معلوماتك الشخصية لتقديم خدمات ودعم من فريق العملاء وبهدف قياس مستوى خدماتنا وتحسينها لك ومنع النشاطات غير القانونية وتنفيذ لبنود اتفاقية الاستخدام الموفقة معك (\"اتفاقية الاستخدام\")، اضافة الى حل المشاكل وجمع الرسوم وتزويدك برسائل الكترونية ترويجية وكذلك من اجل توثيق المعلومات التي زودتنا بها مع اطراف ثالثة مثلا قد نلجأ الى مشاركة بعض من معلوماتك الشخصية مع البنوك او التفويض لبطاقات الائتمان لمعالجة وتوثيق خدمات أو مع اطراف ثالثة لغايات التحقق من عمليات الاحتيال.\n" +
                "برغم حرصنا للمحافظة على سرّيتك، الا اننا قد نحتاج الى الافصاح عن معلوماتك الشخصية لاجهزة تنفيذ القانون والهيئات الحكومية او اطراف ثالثة، نكون ملزمين بفعل ذلك باوامر من المحكمة اوغيرها من الدوائر القانونية لنكون ملتزمين ببنود القانون أو عند اعتقادنا ان الافصاح عن معلوماتك الشخصية ربما يقي من أذى جسدي او خسارة مالية او للاخبار عن نشاط مشبوه او للتحقيق في امكانية انتهاك لبنود وشروط اتفاقية المستخدم واية اتفاقيات أو لحماية الحقوق أو ملكية أو سلامة انتاجي أومستخدمينا أو الغير.\n" +
                "3. قد نفصح عن معلوماتك الشخصية في حال تم بيع انتاجي , او اي من الشركات الفرعية او التابعة لها أو اي من موجداتها المتعقة باعمالها الى المشتري المحتمل وذلك بهدف استمرار نشاط الموقع أو فيما يتعلق بهذا البيع للغايات الموضحة في هذه السياسة. قد نشارك معلوماتك الشخصية مع مجموعة الشركات الأخرى التابعة لنا للأغراض الموضحة في سياسة الخصوصية هذه. ان معلومات الاتصال ستكون المعلومات الشخصية التي قمت بتزويدنا بها عند التسجيل والتي يجب أن تبقى محدثة دائما.\n" +
                "سيتم عرض المعلومات المتعلقة بالمنتجات التي تقوم بشرائها أو بيعها أو المزادات التي تشارك فيها على الموقع. يمكن أن تتضمن هذه المعلومات تفاصيل حول هوية المستخدم الخاصة بك والتقييمات والتعليقات المرتبطة باستخدامك للموقع.\n" +
                "5. لا نبيع أو نؤجر اي من معلوماتك الشخصية لطرف ثالث ضمن نطاق عملنا التجاري المعتاد وسوف نشارك فقط معلوماتك الشخصية فقط وفق ما جاء في (سياسة الخصوصية) هذا.\n" +
                "بمجرد تسجيلك في أو استخدامك للموقع تعتبر أنك أعطيتنا تفويضا واضحا لتسلمك رسائل إلكترونية ترويجية حول خدماتنا إضافة الى رسائل إلكترونية بخصوص التغيرات والملامح الجديدة على الموقع ، بحال عدم رغبتك في تلقي مثل هذه الرسائل ,ماعليك سوى إختيار الرابط الخاص بإيقاف إرسال هذه الرسائل إلى عنوانك البريدي والمتوفر في اسفل اي من هذه الرسائل الإلكترونية\n" +
                "او الذهاب الى جزء \"حسابي\" على الموقع.\n" +
                "\n" +
                "بالاضافة الى ذلك نقوم باستخدام ملاحظاتك حول الموقع لغايات التسويق ومن خلال تقديمك لهذه الملاحظات تكون وافقت على أن نستخدم هذه الملاحظات لغايات التسويق\n"));

        terms.add(new terms("استخدامك لمعلوماتك الشخصية ومعلومات المستخدمين الاخرين", "قد يحتاج الأعضاء في مشاركة المعلومات الشخصية (بما في ذلك المعلومات المالية) مع بعضهم البعض بهدف استكمال عمليات على الموقع. وعليك ان تحترم في جميع الاوقات سرية الاعضاء الاخرين في الموقع.\n" +
                "نحن لا نضمن سرية معلوماتك حين تشارك بها اعضاء في مواقع اخرى، لذا عليك طلب معلومات حول سياسة الخصوصية لهذه المواقع قبل مباشرتك بتزويدهم بأي بيانات معلومات شخصية .\n" +
                "لا تغطي سياسة الخصوصية هذه افصاحك لمعلوماتك الشخصية لعضو في موقع اخر.\n" +
                "توافق على انك لن تستخدم المعلومات الشخصية التي وردتك من الموقع عن أي عضو في موقع اخر وفقا للقوانين المعمول بها في هذه الوثيقة.\n" +
                "تقر وتوافق بأنه عليك إستخدام المعلومات الشخصية التي وردتك من المستخدمين لمواقع اخرى وفقا للقوانين المعمول بها\n"));

        terms.add(new terms("إستخدام ودخول وتصفح وتعديل معلوماتك الشخصية", "باستطاعتك الوصول ومراجعة معلوماتك الشخصية من خلال صفحة إدارة \"حسابي\"على الموقع، فاذا تغيرت معلوماتك الشخصية باي طريقة او اعطيت معلومات غير صحيحة على الموقع فعليك القيام بتحديثها او تصحيحها حالا، اما من خلال عرضها على \"حسابي\" او من خلال الاتصال بفريق خدمة العملاء. يحتوي الرابط الخاص ب \" دعم العملاء\" والموجود في أعلى كل صفحة على البريد الإلكتروني ورقم الهاتف الخاص بهذا القسم.\n" +
                "يرجى العلم أننا سوف نحتفظ بمعلوماتك الشخصية خلال وبعد انتهائك من استخدام الموقع بحسب ما هو مطلوب قانونا، وذلك بهدف التغلب على العوائق التقنية ,ولمنع الاحتيال، و للمساعدة في اي تحقيق قانوني ولاتخاذ اي اجراءات اخرى ينص عليها القانون\n"));

        terms.add(new terms("روابط مواقع الطرف الثالث", "قد يحتوي الموقع على روابط من مواقع الكترونية اخرى، الرجاء العلم باننا غير مسؤولين عن مستوى الخصوصية المتبعة في هذه المواقع الاخرى.نحن نشجعك حين تنتقل من موقعنا الى أي موقع أخر بان تقوم بقراءة بيانات (سياسة الخصوصية) الخاصة بهم إذا كان في نيتك اعطائهم معلوماتك الشخصية . ان (سياسة الخصوصية) عندنا تطبق فقط على معلوماتك الشخصية التي جمعناها على موقعنا"));

        terms.add(new terms("ملفات تعريف الارتباط", "مثل العديد من مواقع الانترنت فان موقعنا يستخدم ملفات تعريف الإرتباط وهي ملفات حاسوب صغيرة يتم تثبيتها على الجزء الصلب من حاسوبك، فحين تذهب لزيارة صفحات انترنت معينة على الموقع, تتعرف السجل على المتصفح الخاص بك من خلال رقم فريد وعشوائي.\n" +
                "كما ان ملفات تعريف الإرتباط التي نستخدمها لا تكشف اي من معلوماتك الشخصية.ان ملفات تعريف الإرتباط هذه تساعدنا في تحسين ادائك على الموقع وتعيننا على تفهم اي اجزاء من الموقع هي الاكثر استخداما,انت لك مطلق الحرية في الغاء هذه ملفات تعريف الإرتباط اذا أتيح لك ذلك من المتصفح ولا يؤثر ذلك على استخدامك للموقع\n"));

        terms.add(new terms("لا للرسائل الالكترونية المضللة او الخادعة", "نحن لا نتساهل مع الرسائل الإلكترونية غير المرغوب بها، بحال رغبت بالتبليع عم مثل هذه الرسائل غير المرغوب بها أو رسائل الإحتيال الإلكترون لا يجوز لك استخدام أدوات الاتصال الخاصة بنا لإرسال رسائل غير مرغوب فيها أو إرسال محتوى ينتهك اتفاقية المستخدم الخاصة بنا. فنحن نفحص الرسائل اوتوماتيكيا وقد نلجأ الى الفلترة اليدوية لها لمعرفة ما اذا هناك رسائل غير مرغوب بها او فيروسات او هجمات ضارة أو اي نشاطات مشبوهة اخرى او غير قانونية"));

        terms.add(new terms("حماية معلوماتك الشخصية", "عند تزودنا بمعلوماتك الشخصية تكون قد وافقت على نقل هذه المعلومات خارج الدولة التي تقسم فيها ، ونحن نتخذ كافة الاحتياطات للمحافظة على معلوماتك وذلك بعدم الوصول اليها او استخدامها او الافصاح عنها بشكل غير مخول.\n" +
                "كافة المعلومات الشخصية مشفرة، وعلى اي حال فان الانترنت وسيلة غير امنة ونحن لا نضمن سرية معلوماتك الشخصية.\n" +
                "يجب ان يتم ادخال اسم المستخدام وكلمة السر في كل مرة عند الدخول الى حسابك أو القيام باية معامللات في الموقع.\n" +
                "يجب ان يتم اختيار كلمة السر بحذر باستخدام ارقام وحروف واشكال مميزة.\n" +
                "لا تشارك اسم المستخدم وكلمة السر مع اي احد.\n" +
                "6. في حال كان لديك شك حول اختراق اسم المستخدم وكلمة السر، يرجى على الفور الاتصال بفريق خدمة العملاء والعمل على تغيير كلمة السر وذلك بالدخول الى قسم حسابي على الموقع\n"));

        terms.add(new terms("كيف تتصل بنا للاستفسار بخصوص (سياسة الخصوصية)", "اذا كان لديك اسئلة او اهتمامات حول جمعنا واستخدامنا لمعلوماتك الشخصية ,الرجاء الاتصال بفريق خدمة العملاء على رابط \"دعم العملاء\" في أعلى أي أي صفحة ويب خاصة على الموقع انتاجي"));

        FirebaseDatabase.getInstance().getReference()
                .child("terms")
                .child("privacy_policy")
                .child("ar")
                .setValue(terms);
    }

    private void onClickListener(){
        backArrow.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                getActivity().onBackPressed();
            }
        });
    }

    public class terms {

        String title;
        String data;

        public terms(String title, String data) {
            this.title = title;
            this.data = data;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getData() {
            return data;
        }

        public void setData(String data) {
            this.data = data;
        }
    }

}

